#-это коментарий
print ("hello world")
#**-Возведение в степень
#%-Деление по модулю
#//-Целочисленные деления с отбрасыванием дробной части
#/-Деление *-Умножение --Вычитание +-Сложение
print(23 % 7)
print(23 // 7)
# int() целочисленный тип данных, целые числа
# "" - str()строки
# float - вещественные числа, с плавающей точкой
my_name = " Артем"
my_friend = "Александр"
my_nubmer = "47"
print(my_friend + " "+ my_name)
print(my_name + " 47 ")
print(my_name + " " + str(my_nubmer))
print(f"{my_name} {my_nubmer}")
print (my_name * 5)
# Переменная - это область памяти компьютера, в которой, может храниться одиночное значение, знак = - является оператором присваивания и сохраняет значения
color = "black"
print(color)

